; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-19)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 room6 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(room room6)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 roomb)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 room3)
(at ball7 room3)
(at ball8 room3)
(at ball9 room3)
(at ball10 room3)
(at ball11 room4)
(at ball12 room5)
(at ball13 room5)
(at ball14 room5)
(at ball15 room5)
(at ball16 room6)
(at ball17 room6)
(at ball18 room6)
(at ball19 room6)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 rooma)
(at ball13 rooma)
(at ball14 rooma)
(at ball15 rooma)
(at ball16 rooma)
(at ball17 rooma)
(at ball18 rooma)
(at ball19 rooma)
)
)
)

; plan
1. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 2 of 19
2. (pick ball5 roomb left)
   deleted: (at ball5 roomb) (free left)
   added: (carry ball5 left)
   goals met: 2 of 19
3. (pick ball4 roomb right)
   deleted: (at ball4 roomb) (free right)
   added: (carry ball4 right)
   goals met: 2 of 19
4. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 2 of 19
5. (drop ball4 rooma right)
   deleted: (carry ball4 right)
   added: (at ball4 rooma) (free right)
   goals met: 3 of 19
6. (drop ball5 rooma left)
   deleted: (carry ball5 left)
   added: (at ball5 rooma) (free left)
   goals met: 4 of 19
7. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 4 of 19
8. (pick ball3 roomb left)
   deleted: (at ball3 roomb) (free left)
   added: (carry ball3 left)
   goals met: 4 of 19
9. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 4 of 19
10. (pick ball19 room6 right)
   deleted: (at ball19 room6) (free right)
   added: (carry ball19 right)
   goals met: 4 of 19
11. (move room6 rooma)
   deleted: (at-robby room6)
   added: (at-robby rooma)
   goals met: 4 of 19
12. (drop ball19 rooma right)
   deleted: (carry ball19 right)
   added: (at ball19 rooma) (free right)
   goals met: 5 of 19
13. (drop ball3 rooma left)
   deleted: (carry ball3 left)
   added: (at ball3 rooma) (free left)
   goals met: 6 of 19
14. (move rooma room6)
   deleted: (at-robby rooma)
   added: (at-robby room6)
   goals met: 6 of 19
15. (pick ball18 room6 left)
   deleted: (at ball18 room6) (free left)
   added: (carry ball18 left)
   goals met: 6 of 19
16. (pick ball17 room6 right)
   deleted: (at ball17 room6) (free right)
   added: (carry ball17 right)
   goals met: 6 of 19
17. (move room6 rooma)
   deleted: (at-robby room6)
   added: (at-robby rooma)
   goals met: 6 of 19
18. (drop ball17 rooma right)
   deleted: (carry ball17 right)
   added: (at ball17 rooma) (free right)
   goals met: 7 of 19
19. (drop ball18 rooma left)
   deleted: (carry ball18 left)
   added: (at ball18 rooma) (free left)
   goals met: 8 of 19
20. (move rooma room6)
   deleted: (at-robby rooma)
   added: (at-robby room6)
   goals met: 8 of 19
21. (pick ball16 room6 left)
   deleted: (at ball16 room6) (free left)
   added: (carry ball16 left)
   goals met: 8 of 19
22. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 8 of 19
23. (pick ball15 room5 right)
   deleted: (at ball15 room5) (free right)
   added: (carry ball15 right)
   goals met: 8 of 19
24. (move room5 rooma)
   deleted: (at-robby room5)
   added: (at-robby rooma)
   goals met: 8 of 19
25. (drop ball15 rooma right)
   deleted: (carry ball15 right)
   added: (at ball15 rooma) (free right)
   goals met: 9 of 19
26. (drop ball16 rooma left)
   deleted: (carry ball16 left)
   added: (at ball16 rooma) (free left)
   goals met: 10 of 19
27. (move rooma room5)
   deleted: (at-robby rooma)
   added: (at-robby room5)
   goals met: 10 of 19
28. (pick ball14 room5 left)
   deleted: (at ball14 room5) (free left)
   added: (carry ball14 left)
   goals met: 10 of 19
29. (pick ball13 room5 right)
   deleted: (at ball13 room5) (free right)
   added: (carry ball13 right)
   goals met: 10 of 19
30. (move room5 rooma)
   deleted: (at-robby room5)
   added: (at-robby rooma)
   goals met: 10 of 19
31. (drop ball13 rooma right)
   deleted: (carry ball13 right)
   added: (at ball13 rooma) (free right)
   goals met: 11 of 19
32. (drop ball14 rooma left)
   deleted: (carry ball14 left)
   added: (at ball14 rooma) (free left)
   goals met: 12 of 19
33. (move rooma room5)
   deleted: (at-robby rooma)
   added: (at-robby room5)
   goals met: 12 of 19
34. (pick ball12 room5 left)
   deleted: (at ball12 room5) (free left)
   added: (carry ball12 left)
   goals met: 12 of 19
35. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 12 of 19
36. (pick ball11 room4 right)
   deleted: (at ball11 room4) (free right)
   added: (carry ball11 right)
   goals met: 12 of 19
37. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 12 of 19
38. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 12 of 19
39. (drop ball11 rooma right)
   deleted: (carry ball11 right)
   added: (at ball11 rooma) (free right)
   goals met: 13 of 19
40. (drop ball12 rooma left)
   deleted: (carry ball12 left)
   added: (at ball12 rooma) (free left)
   goals met: 14 of 19
41. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 14 of 19
42. (pick ball9 room3 left)
   deleted: (at ball9 room3) (free left)
   added: (carry ball9 left)
   goals met: 14 of 19
43. (pick ball8 room3 right)
   deleted: (at ball8 room3) (free right)
   added: (carry ball8 right)
   goals met: 14 of 19
44. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 14 of 19
45. (drop ball8 rooma right)
   deleted: (carry ball8 right)
   added: (at ball8 rooma) (free right)
   goals met: 15 of 19
46. (drop ball9 rooma left)
   deleted: (carry ball9 left)
   added: (at ball9 rooma) (free left)
   goals met: 16 of 19
47. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 16 of 19
48. (pick ball7 room3 left)
   deleted: (at ball7 room3) (free left)
   added: (carry ball7 left)
   goals met: 16 of 19
49. (pick ball6 room3 right)
   deleted: (at ball6 room3) (free right)
   added: (carry ball6 right)
   goals met: 16 of 19
50. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 16 of 19
51. (drop ball6 rooma right)
   deleted: (carry ball6 right)
   added: (at ball6 rooma) (free right)
   goals met: 17 of 19
52. (drop ball7 rooma left)
   deleted: (carry ball7 left)
   added: (at ball7 rooma) (free left)
   goals met: 18 of 19
53. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 18 of 19
54. (pick ball10 room3 left)
   deleted: (at ball10 room3) (free left)
   added: (carry ball10 left)
   goals met: 18 of 19
55. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 18 of 19
56. (drop ball10 rooma left)
   deleted: (carry ball10 left)
   added: (at ball10 rooma) (free left)
   goals met: 19 of 19
